infra/kaggle/kernel_openfoam_xfid_v16/rejected_preexecution_round_01/case_template/Allrun
#!/usr/bin/env bash
set -euo pipefail
blockMesh
surfaceFeatureExtract || true
snappyHexMesh -overwrite
checkMesh -allGeometry -allTopology 2>&1 | tee log.checkMesh
simpleFoam 2>&1 | tee log.simpleFoam
