infra/kaggle/kernel_openfoam_xfid_v16/rejected_preexecution_round_01/case_template/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;
