infra/kaggle/kernel_openfoam_xfid_v16/rejected_preexecution_round_01/case_template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-2.5 -1.2 -0.9)
    (2.5 -1.2 -0.9)
    (2.5 1.2 -0.9)
    (-2.5 1.2 -0.9)
    (-2.5 -1.2 0.9)
    (2.5 -1.2 0.9)
    (2.5 1.2 0.9)
    (-2.5 1.2 0.9)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 13 9) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    sideMin { type patch; faces ((0 1 5 4)); }
    sideMax { type patch; faces ((3 7 6 2)); }
    top { type patch; faces ((4 5 6 7)); }
    bottom { type wall; faces ((0 3 2 1)); }
);

mergePatchPairs ();
